
public class 이차원배열_행렬출력{
/*	형식: 데이터형[행][열] 배열명; (권장)/ 데이터형 배열명[][]; , 데이터형[] 배열명[]; 모두 가능
 *	초기화
 *	ex) int[][] arr{{1,2,3},{4,5,6},{7,8,9}}
 *		=>3행(덩어리) 3열(덩어리 속 숫자)
 *				0			1			2
 *		======================================
 *	0			1			2			3
 *			arr[0][0]	arr[0][1]	arr[0][2]
 *		======================================
 * 	1			4			5			6
 *			arr[1][0]	arr[1][1]	arr[1][2]
 * 		======================================
 * 	2			7			8			9
 *			arr[2][0]	arr[2][1]	arr[2][2]
 * 		======================================
 * 	
 * 		=>2중 for:퍼즐게임, 지뢰찾기, 빙고게임
 */
	public static void main(String[] args){
		int[][] arr=new int[5][5]; //5행 5열 → 초기화
		
		int k=1; //1~25
		//초기값
		for(int i=0;i<5;i++) { //행
			for(int j=0;j<5;j++) { //열
				arr[i][j]=k;
				k++;
			}
		}
		
		//출력
		for(int i=0;i<5;i++) {
			for(int j=0;j<5;j++) {
				System.out.printf("arr[%d][%d]=%d\t",i,j,arr[i][j]);
			}
			System.out.println();
		}

	}

}
